import { title } from "node:process";

export const poetryData = [
  {
    title: "静夜思",
    author: "李白",
    content: "床前明月光，疑是地上霜。举头望明月，低头思故乡。"
  },
  {
    title: "将进酒",
    author: "李白",
    content: "君不见，黄河之水天上来，奔流到海不复回。\n 君不见，高堂明镜悲白发，朝如青丝暮成雪。\n 人生得意须尽欢，莫使金樽空对月。\n 天生我材必有用，千金散尽还复来。\n 烹牛宰羊且为乐，会须一饮三百杯。\n 岑夫子，丹丘生，将进酒，杯莫停。\n 主人何为言少钱，五花马，千金裘，呼儿将出换美酒，与尔同消万古愁"

  },
    {
    title: "蜀道难",
    author: "李白",
    content: "蜀道难，难于上青天。\n 蚕丛及鱼凫，开国何茫然。\n 尔来四万八千岁，不与秦塞通人烟。\n 西当太白有鸟道，可以横绝峨眉巅。\n 地崩山摧壮士死，然后天梯石栈相钩连。\n 上有六龙回日之高标，下有冲波逆折之回川。\n 黄鹤之飞尚不得过，猿猱欲穷千里目。\n"
  },
  {
    title: "春晓",
    author: "孟浩然",
    content: "春眠不觉晓，处处闻啼鸟。夜来风雨声，花落知多少。"
  },
  {
    title: "过故人庄",
    author: "孟浩然",
    content: "故人具鸡黍，邀我至田家。绿树村边合，青山郭外斜。开轩面场圃，把酒话桑麻。待到重阳日，还来就菊花。"
  },
  {
    title: "望岳",
    author: "杜甫",
    content: "岱宗夫如何？齐鲁青未了。造化钟神秀，阴阳割昏晓。\n 荡胸生层云，决眦入归鸟。会当凌绝顶，一览众山小。"
  },
  {
    title: "咏鹅",
    author: "骆宾王",
    content: "鹅，鹅，鹅，曲项向天歌。白毛浮绿水，红掌拨清波。"
  },
  {
    title: "登鹳雀楼",
    author: "王之涣",
    content: "白日依山尽，黄河入海流。欲穷千里目，更上一层楼。"
  },
  {
    title: "江雪",
    author: "柳宗元",
    content: "千山鸟飞绝，万径人踪灭。孤舟蓑笠翁，独钓寒江雪。"
  },
   {
    title: "钱塘湖春行",
    author: "白居易",
    content: "孤山寺北贾亭西，水面初平云脚低。几处早莺争暖树，谁家新燕啄春泥。\n 乱花渐欲迷人眼，浅草才能没马蹄。最爱湖东行不足，绿杨阴里白沙堤。"
  },
  {
    title: "赋得古原草送别",
    author: "白居易",
    content: "离离原上草，一岁一枯荣。\n 野火烧不尽，春风吹又生。\n 远芳侵古道，晴翠接荒城。\n 又送王孙去，萋萋满别情。"
  },
  {
    title: "秋词",
    author: "刘禹锡",
    content: "自古逢秋悲寂寥，我言秋日胜春朝。\n 晴空一鹤排云上，便引诗情到碧霄。"
  },
    {
    title: "竹枝词",
    author: "刘禹锡",
    content: "杨柳青青江水平，闻郎江上唱歌声，\n 东边日出西边雨，道是无晴却有晴。"
  },
  {
    title: "关雎",
    chapter: "诗经",
    content: "关关雎鸠，在河之洲。窈窕淑女，君子好逑。"
  },
  {
    title: "蒹葭",
    chapter: "诗经",
    content: "蒹葭苍苍，白露为霜。所谓伊人，在水一方。\n 溯洄从之，道阻且长。葭以为霜，所谓伊人，在水之湄。\n 溯洄从之，道阻且跻。葭以为霜，所谓伊人，在水之涘。\n 溯洄从之，道阻且右。"
  
  },
  {
    title: "长歌行",
    chapter: "佚名",
    content: "青青园中葵，朝露待日晞。\n 阳春布德泽，万物生光辉。\n 常恐秋节至，焜黄华叶衰。\n 百川东到海，何时复西归。\n 少壮不努力，老大徒伤悲。"
  
  },
  {
    title: "水调歌头",
    author: "苏轼",
    content: "明月几时有？把酒问青天。不知天上宫阙，今夕是何年。\n  我欲乘风归去，又恐琼楼玉宇，高处不胜寒。起舞弄清影，何似在人间？\n 转朱阁，低绮户，照无眠。不应有恨，何事长向别时圆？\n人有悲欢离合，月有阴晴圆缺，此事古难全。但愿人长久，千里共婵娟。"
  },
  {
    title: "念奴娇·赤壁怀古",
    author: "苏轼",
    content: "大江东去，浪淘尽，千古风流人物。故垒西边，人道是，三国周郎赤壁。\n    乱石穿空，惊涛拍岸，卷起千堆雪。江山如画，一时多少豪杰。\n 遥想公瑾当年，小乔初嫁了，雄姿英发。羽扇纶巾，谈笑间，樯橹灰飞烟灭。\n 故国神游，多情应笑我，早生华发。人生如梦，一尊还酹江月。"
  },
  {
    title: "江城子·乙卯正月二十日夜记梦",
    author: "苏轼",
    content: "十年生死两茫茫，不思量，自难忘。千里孤坟，无处话凄凉。\n 纵使相逢应不识，尘满面，鬓如霜。\n 夜来幽梦忽还乡，小轩窗，正梳妆。相顾无言，惟有泪千行。\n 料得年年肠断处，明月夜，短松冈。"
  },
  {
    title: "青玉案·元夕",
    author: "辛弃疾",
    content: "东风夜放花千树，更吹落、星如雨。宝马雕车香满路。凤箫声动，玉壶光转，一夜鱼龙舞。\n 蛾儿雪柳黄金缕，笑语盈盈暗香去。众里寻他千百度，蓦然回首，那人却在灯火阑珊处。"
  },
  {
    title: "天净沙·秋思",
    author: "马致远",
    content: "枯藤老树昏鸦，小桥流水人家，古道西风瘦马。夕阳西下，断肠人在天涯。"
  },
  {
    title: "苔",
    author: "袁枚",
    content: "白日不到处，青春恰自来。苔花如米小，也学牡丹开。"
  },
  {
    title: "定风波",
    author: "苏轼",
    content: "定风波·莫听穿林打叶声，何妨吟啸且徐行。竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。\n    料峭春风吹酒醒，微冷，山头斜照却相迎。回首向来萧瑟处，归去，也无风雨也无晴。"
  },

  {
    title: "如梦令",
    author: "李清照",
    content: "昨夜雨疏风骤，浓睡不消残酒。试问卷帘人，却道海棠依旧。\n    知否，知否，应是绿肥红瘦。\n      "
  },
  {
    title: "声声慢",
    author: "李清照",
    content: "寻寻觅觅，冷冷清清，凄凄惨惨戚戚。\n 乍暖还寒时候，最难将息。三杯两盏淡酒，怎敌他、晚来风急？\n 雁过也，正伤心，却是旧时相识。\n 满地黄花堆积。憔悴损，如今有谁堪摘？\n 守着窗儿，独自怎生得黑？梧桐更兼细雨，到黄昏、点点滴滴。这次第，怎一个愁字了得！"
  }
  ,
  {
    title: "一剪梅",
    author: "李清照",
    content: "红藕香残玉簟秋。轻解罗裳，独上兰舟。\n 云中谁寄锦书来？雁字回时，月满西楼。\n 花自飘零水自流。一种相思，两处闲愁。\n 此情无计可消除。才下眉头，却上心头。"
  }
  ,
  {
    title: "醉花阴",
    author: "李清照",
    content: "薄雾浓云愁永昼，瑞脑消金兽。佳节又重阳，玉枕纱厨，半夜凉初透。\n 东篱把酒黄昏后，有暗香盈袖。莫道不销魂，帘卷西风，人比黄花瘦。"
  }
    ,
  {
    title: "满江红",
    author: "岳飞",
    content: "怒发冲冠，凭栏处、潇潇雨歇。抬望眼、仰天长啸，壮怀激烈。\n 三十功名尘与土，八千里路云和月。莫等闲、白了少年头，空悲切。\n 靖康耻，犹未雪；臣子恨，何时灭！\n 驾长车、踏破贺兰山缺。壮志饥餐胡虏肉，笑谈渴饮匈奴血。待从头、收拾旧山河，朝天阙。"
  },
{
    title:"长征",
    author: "毛泽东",
    content: "红军不怕远征难，万水千山只等闲。五岭逶迤腾细浪，乌蒙磅礴走泥丸。\n 金沙水拍云崖暖，大渡桥横铁索寒。更喜岷山千里雪，三军过后尽开颜。"
  },
  {
    title: "沁园春·长沙",
    author: "毛泽东",
    content: "独立寒秋，湘江北去，橘子洲头。\n 看万山红遍，层林尽染；漫江碧透，百舸争流。\n 鹰击长空，鱼翔浅底，万类霜天竞自由。\n 怅寥廓，问苍茫大地，谁主沉浮？"
  }
  ,
  {
    title: "沁园春·雪",
    author: "毛泽东",
    content: " 北国风光，千里冰封，万里雪飘。\n 望长城内外，惟余莽莽；大河上下，顿失滔滔。\n 山舞银蛇，原驰蜡象，欲与天公试比高。\n 须晴日，看红装素裹，分外妖娆。\n 江山如此多娇，引无数英雄竞折腰。\n 惜秦皇汉武，略输文采；唐宗宋祖，稍逊风骚。\n 一代天骄，成吉思汗，只识弯弓射大雕。\n 俱往矣，数风流人物，还看今朝。"
  }
  ,
  {
    title: "送别",
    author: "李叔同",
    content: "长亭外，古道边，芳草碧连天。\n 晚风拂柳笛声残，夕阳山外山。天之涯，地之角，知交半零落。\n 一壶浊酒尽余欢，今宵别梦寒。\n 情千缕，酒一杯，声声离笛催.\n 问君此去几时来，来时莫徘徊"
  }
];
